ValidationCase/constant/kinematicCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      particleProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         true;
    transient       yes;
    cellValueSourceCorrection on;

    interpolationSchemes
    {
        rho.air         cell;
        U.air           cellPoint;
        mu.air          cell;
        alpha.air       cell;
    }

    averagingMethod basic;

    integrationSchemes
    {
        U               Euler;
    }

    sourceTerms
    {
        schemes
        {
            U semiImplicit 1;
        }
    }
}

constantProperties
{
    rho0            1000;
    alphaMax        0.9;
}

subModels
{
    particleForces
    {
        sphereDrag;
    }

    injectionModels
    {
        injector1
        {
            type            coneInjection;
            SOI             0;
            massTotal       0.095;
            parcelBasisType mass;              // self adjusting via rho?
            injectionMethod disc;
            flowType        constantVelocity;
            Umag            3;
            U0              (0 -1 0);
            flowRateProfile constant 1;

            dInner          0;
            dOuter          1e-2;

            duration        3;
            position        (0.5 0.6 1);
            direction       (0 -1 0);

            parcelsPerSecond 57000;
            nParticle        1;
        
            thetaInner      constant 0.0;
            thetaOuter      constant 40.0;

            sizeDistribution
            {
                type        RosinRammler;

                RosinRammlerDistribution
                {
                    minValue    1.5e-4;
                    maxValue    5e-4;
                    d           3e-4;
                    n           3;
                }
            }
        }
    }

    dispersionModel none;

    patchInteractionModel localInteraction;

    localInteractionCoeffs
    {
        patches
        (
            sides
            {
                type    escape;
            }

            front
            {
                type    escape;
            }

            ground
            {
                type    escape;
            }

            top
            {
                type    escape;
            }

            back
            {
                type    escape;
            }
        );
    }

    heatTransferModel none;

    compositionModel  none;

    packingModel none;

    dampingModel relaxation;
    
    surfaceFilmModel    none;

    relaxationCoeffs
    {
        timeScaleModel
        {
            type nonEquilibrium;
            alphaPacked 0.58;
            e 0.9;
        }
    }

    isotropyModel stochastic;

    stochasticCoeffs
    {
        timeScaleModel
        {
            type isotropic;
            alphaPacked 0.58;
            e 0.9;
        }
    }

    stochasticCollisionModel none;

    radiation off;
}


cloudFunctions
{
    #include "CollectorFaces"
}


// ************************************************************************* //
